ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
#define MAIN_SHOW_C
#include "includes.h"

#if QT_EN
#include <mainwindow.h>
extern MainWindow *w;
#endif

/*
//每档速度的延时,单位为毫秒
const INT16U Step_Delay[]=
{
  10,
  20,
  30,
  40,
  50,
  60,
  70,
  80,
  90,
  100
};
*/
//获取某个窗口区域某个步进的停留时间
INT32U Get_Area_In_Step_Delay(INT8U Area_No)
{
    if(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed > 0)
      return Prog_Status.File_Para[Area_No].Pic_Para.In_Speed * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
}

//获取某个窗口区域某个步进的停留时间
INT32U Get_Area_Out_Step_Delay(INT8U Area_No)
{
    if(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed > 0)
      return Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed * MOVE_STEP_PERIOD; //CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);///(100/MOVE_STEP);
    else
      return MOVE_STEP_PERIOD;
}
/*
//获取文件引入时间
INT32U Get_File_In_Speed(INT8U Area_No)
{
 return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.In_Speed);
  
}
*/
//获取文件的停留时间,单位为ms
//原参数最高为表示单位，0为s，1为ms
INT32U Get_File_Stay_Time(INT8U Area_No)
{
  return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time);
}
/*
//获取文件引出时间
INT32U Get_File_Out_Speed(INT8U Area_No)
{
  return CONVERT_TIME(Prog_Status.File_Para[Area_No].Pic_Para.Out_Speed);
}
*/
//设置文件的停留时间
void Set_File_Stay_Time(INT8U Area_No, INT16U ms)
{
  Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time = ms;
  Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time = Prog_Status.File_Para[Area_No].Pic_Para.Stay_Time | 0x8000;
}

//检查Area_No分区当前显示数据是否连移数据
INT8U Chk_Pic_Continuous_Move(INT8U Area_No)
{
    if(Prog_Status.Area_Status[Area_No].In_Mode >= 1 &&\
       Prog_Status.Area_Status[Area_No].In_Mode <= 2 &&\
       Get_File_Stay_Time(Area_No) EQ 0 &&\
       Prog_Status.File_Para[Area_No].Pic_Para.Flag EQ SHOW_PIC)
        return 1;
    else
        return 0;

}

//每隔MOVE_STEP_TIMER ms调用该函数,实现移动显示等效果
void Update_Show_Data(void)
{
  INT8U i;

  if(Screen_Status.Open_Flag EQ 0)
    return;

  if(Prog_Status.Play_Status.RT_Play_Flag EQ RT_PLAY_FLAG) //当前在关机状态或者实时显示状态
	{/*
	  if(Prog_Status.Play_Status.RT_Play_Flag EQ RT_PLAY_FLAG)
	  {
	    Prog_Status.Play_Status.RT_Play_Time -= MOVE_STEP_PERIOD;
		if(Prog_Status.Play_Status.RT_Play_Time EQ 0)
		  RT_Play_Status_Exit();  
	  }    
	  */
	  return;
	}
  for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
  {
      if(Screen_Status.Com_Time > 0) //收到一帧，先处理此帧
          return;
//#if PIC_SHOW_EN    
    //if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_PIC)
      Update_Pic_Data(i);
	  
#if BORDER_SHOW_EN
      Update_Border_Data(i); //更新边框数据
#endif


//#endif
/*
#if CLOCK_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_CLOCK)
      Update_Clock_Data(i);
#endif
      */
    /*
#if TIMER_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TIMER)
      Update_Timer_Data(i);
#endif
      */
    /*
#if TIME_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TIME)
      Update_Time_Data(i);
#endif
      */
    /*
#if TEMP_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_TEMP)
      Update_Temp_Data(i);
#endif
      */
    /*
#if LUN_SHOW_EN
    else if(Prog_Status.File_Para[i].Pic_Para.Flag EQ SHOW_LUN)
      Update_Lun_Data(i);
#endif
      */
  }

#if BORDER_SHOW_EN
      Update_Border_Data(MAX_AREA_NUM); //更新边框数据
#endif

}

//更新显示备份区数据、显示非固定文本类信息
INT8U Update_XXX_Data(S_Show_Data *pDst, INT8U Area_No)
{
  INT8U Flag; 
  
  Flag = Prog_Status.File_Para[Area_No].Pic_Para.Flag;
  
  //某些非图文数据需要定时刷新!应该保证每分钟进入一次
  if(Flag EQ SHOW_PIC)
    ;
#if CLOCK_SHOW_EN  
  else if(Flag EQ SHOW_CLOCK)
    Update_Clock_Data(pDst, Area_No);
#endif
#if TIME_SHOW_EN  
  else if(Flag EQ SHOW_TIME)
    Update_Time_Data(pDst, Area_No);
#endif
#if TIMER_SHOW_EN  
  else if(Flag EQ SHOW_TIMER)
    Update_Timer_Data(pDst, Area_No);
#endif
#if TEMP_SHOW_EN  
  else if(Flag EQ SHOW_TEMP)
    Update_Temp_Data(pDst, Area_No);
#endif
#if LUN_SHOW_EN  
  else if(Flag EQ SHOW_LUN)
    Update_Lun_Data(pDst, Area_No);
#endif
#if HUMIDITY_SHOW_EN
  else if(Flag EQ SHOW_HUMIDITY)
    Update_Humidity_Data(pDst, Area_No);
#endif
#if NOISE_SHOW_EN
  else if(Flag EQ SHOW_NOISE)
    Update_Noise_Data(pDst, Area_No);
#endif
  else
    ASSERT_FAILED(); 
  
  return 1;
}

//清楚某个分区的状态
void Clr_Area_Status(INT8U Area_No)
{
  if(Area_No >= MAX_AREA_NUM)
  {
    ASSERT_FAILED();
    return;
  }
  
  memset(&Prog_Status.Area_Status[Area_No], 0, sizeof(Prog_Status.Area_Status[Area_No])); 
  SET_HT(Prog_Status.Area_Status[Area_No]);
}
/*
void Clr_All_Area_Status()
{
    INT8U i;

    for(i = 0; i < MAX_AREA_NUM; i++)
    {
        Clr_Area_Status(i);
    }
}
*/
void Clr_Show_Data(void)
{
  memset(Show_Data.Color_Data, 0, sizeof(Show_Data.Color_Data));
  memset(Show_Data_Bak.Color_Data, 0, sizeof(Show_Data_Bak.Color_Data));
  SET_HT(Show_Data);
  SET_HT(Show_Data_Bak);
}

//读取连移数据
void Read_Continous_Move_Show_Data(S_Show_Data *pDst, INT8U Area_No)
{
    INT16U Area_Width, Area_Height, Border_Height,i,j;

    Area_Width = Get_Area_Width(Area_No);
    Area_Height = Get_Area_Height(Area_No);
    Border_Height = Get_Area_Border_Height(Area_No);

    if(Area_Height > 2*Border_Height)
        Area_Height = Area_Height - 2*Border_Height;
    else
        return;

    if(Area_Width > 2*Border_Height)
        Area_Width = Area_Width - 2*Border_Height;
    else
        return;

    //左平移或者连续左移
    if(Prog_Status.Area_Status[Area_No].In_Mode EQ 1 ||\
       Prog_Status.Area_Status[Area_No].In_Mode EQ 3)
    {
        for(j = 0; j < Area_Height; j ++)
        {
           i = Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  &Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else if(Prog_Status.Area_Status[Area_No].In_Mode EQ 2 ||\
            Prog_Status.Area_Status[Area_No].In_Mode EQ 5)//连续上移或者上移
    {
        for(i = 0; i < Area_Width; i = i+8)
        {
             j = Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  &Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else if(Prog_Status.Area_Status[Area_No].In_Mode EQ 4) //右平移
    {
        for(j = 0; j < Area_Height; j ++)
        {
           i = Prog_Status.Area_Status[Area_No].In_Max_Step - Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  &Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
    else//下平移
    {
        for(i = 0; i < Area_Width; i = i+8)
        {
             j = Prog_Status.Area_Status[Area_No].In_Max_Step - Prog_Status.Area_Status[Area_No].In_Step;
             Read_Show_Data_Point(Area_No, \
                                  Prog_Status.Area_Status[Area_No].File_No, \
                                  &Prog_Status.File_Para[Area_No], \
                                  Prog_Status.Area_Status[Area_No].SCN_No,\
                                  pDst, \
                                  i, \
                                  j);
        }
    }
}

//检查Area_No当前播放文件是否播放当此完毕?
INT8U Chk_File_Play_End(INT8U Area_No)
{
    if(Prog_Status.Area_Status[Area_No].SCN_No >= Prog_Status.File_Para[Area_No].Pic_Para.SNum)
    {
        Prog_Status.Area_Status[Area_No].New_File_Flag = NEW_FLAG;

