ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
      debug("\r\nread prog %d area %d, file %d %dth SCN show data", \
            Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No,Prog_Status.Area_Status[Area_No].SCN_No);
#if 0
      if(Prog_Status.Area_Status[Area_No].Last_SCN_No EQ Prog_Status.Area_Status[Area_No].SCN_No &&\
         CHK_HT(Prog_Status.Area_Status[Area_No]) &&\
         CHK_SUM(Prog_Status.Area_Status[Area_No]) &&\
         Check_XXX_Data(Prog_Status.File_Para[Area_No].Pic_Para.Flag) EQ 0)
      {
         debug("the same as last SCN ,no update");
         Len0 = 1;
      }
      else
#endif
      {
          Clear_Area_Data(&Show_Data_Bak, Area_No);

          Prog_Status.Area_Status[Area_No].Last_SCN_No = 0xFFFF;
          SET_SUM(Prog_Status.Area_Status[Area_No]);

          Len0 = -1;
    #if DATA_PREP_EN > 0
          if(GET_VAR(Prep_Data.Data_Prog_No[Area_No]) EQ Prog_Status.Play_Status.Prog_No &&\
             GET_VAR(Prep_Data.Data_File_No[Area_No]) EQ Prog_Status.Area_Status[Area_No].File_No &&\
             GET_VAR(Prep_Data.Data_Ok_Flag[Area_No]) EQ DATA_OK &&\
             GET_VAR(Prep_Data.Data_SCN_No[Area_No]) EQ Prog_Status.Area_Status[Area_No].SCN_No)
          {

            S_Point P0;
            debug("use prepaid data: area_no:%d, SCN_No:%d", Area_No, GET_VAR(Prep_Data.Data_SCN_No[Area_No]));
            P0.X = GET_VAR(Prep_Data.Data_X[Area_No]);
            P0.Y = GET_VAR(Prep_Data.Data_Y[Area_No]);
            Copy_Filled_Rect(&Prep_Data.Show_Data, \
                             Area_No,\
                             &P0,\
                             GET_VAR(Prep_Data.Data_Width[Area_No]),\
                             GET_VAR(Prep_Data.Data_Height[Area_No]),\
                             &Show_Data_Bak,\
                             &P0);

            Len0 = 1;//GET_TEXT_LEN(Prep_Data.Data_Width[Area_No]
          }
          else
              Len0 = Read_Show_Data(Area_No, \
                             Prog_Status.Area_Status[Area_No].File_No, \
                             &Prog_Status.File_Para[Area_No],\
                             Prog_Status.Area_Status[Area_No].SCN_No,\
                             &Show_Data_Bak,&X,&Y,&Width,&Height);

          SET_VAR(Prep_Data.Data_Read_Flag[Area_No] , DATA_READ);
    #else
          Len0 = Read_Show_Data(Area_No, \
                         Prog_Status.Area_Status[Area_No].File_No, \
                         &Prog_Status.File_Para[Area_No],\
                         Prog_Status.Area_Status[Area_No].SCN_No,\
                         &Show_Data_Bak,&X,&Y,&Width,&Height);
    #endif
      }

      TRACE();

      if(Len0 >= 0)
      {
        Prog_Status.Area_Status[Area_No].Last_SCN_No = Prog_Status.Area_Status[Area_No].SCN_No;
        //Prog_Status.Area_Status[Area_No].Play_Flag = 1; //打开本分区显示
        Prog_Status.Area_Status[Area_No].New_SCN_Flag = 0;
        SET_SUM(Prog_Status.Area_Status[Area_No]);
      }
      else
      {
        //本屏显示数据没有读到则读下屏数据

        ASSERT_FAILED();
        Prog_Status.Area_Status[Area_No].New_SCN_Flag = NEW_FLAG;
        Prog_Status.Area_Status[Area_No].SCN_No ++; //显示屏数增加
        SET_SUM(Prog_Status.Area_Status[Area_No]);
      }
  }

  if(Prog_Status.Area_Status[Area_No].New_CStep_Flag)
  {
      //已经到了最大的一幕则切换到下个文件
      if(Chk_File_Play_End(Area_No))
          return 0;

      if(Prog_Status.Area_Status[Area_No].In_Step < Prog_Status.Area_Status[Area_No].In_Max_Step)
      {
          Read_Continous_Move_Show_Data(&Show_Data_Bak, Area_No);
      }
      else
      {
          Prog_Status.Area_Status[Area_No].SCN_No ++; //显示屏数增加
          SET_SUM(Prog_Status.Area_Status[Area_No]);
      }

      Prog_Status.Area_Status[Area_No].New_CStep_Flag = 0;
      SET_SUM(Prog_Status.Area_Status[Area_No]);
  }
//-----------------
  return AREA_OK;
}


//检测更新显示备份区数据
INT8U Check_Update_Show_Data_Bak(void)
{
  INT8U i;
  //INT32U Stay_Time;
  //S_Int8U Sec = {CHK_BYTE, 0xFF, {0},CHK_BYTE};
  
  //if(Prog_Status.Play_Status.Play_Flag EQ 0)
      //return 0;

  for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
  {

     if(Screen_Status.Rcv_Flag EQ FRAME_FLAG) //收到一帧，先处理此帧
         return 1;

     if(Prog_Status.Area_Status[i].New_File_Flag ||\
        Prog_Status.Area_Status[i].New_SCN_Flag ||\
        Prog_Status.Area_Status[i].New_CStep_Flag)
     {
      Update_Show_Data_Bak(Prog_Para.Prog_No, i);// == FILE_END)
    }
  }
 /*
  //每秒更新一下时钟、温度、计时等数据
  if(Sec.Var != Cur_Time.Time[T_SEC])
  {
    Sec.Var = Cur_Time.Time[T_SEC];    
    for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
    {    
      Update_XXX_Data_Bak(i);
    }
  }
  */
  return 1;
}

void Check_Update_Show_Data(void)
{
  
}

void Clr_Prog_Status(void)
{
  memset(&Prog_Status, 0, sizeof(Prog_Status));
  //SET_HT(Prog_Status);
  
}

//检查节目是否播放结束
//返回1表示结束了，0表示还没有结束
INT8U _Check_Prog_End(void)
{
  if(Check_Prog_Play_Time() EQ 0)
  {
     debug("prog %d now not play time, end", Prog_Status.Play_Status.Prog_No);
     return 1;
  }
  //次数模式
  if(Prog_Para.Mode EQ PROG_COUNTS_MODE)
  {
    if(Prog_Status.Play_Status.Counts >= Prog_Para.Counts)
    {
      debug("prog %d play counts %d, end", Prog_Status.Play_Status.Prog_No, Prog_Status.Play_Status.Counts);
      return 1;
    }
    else
      return 0;
  }
  else if(Prog_Para.Mode EQ PROG_TIME_MODE)//时间模式
  {
    if(Prog_Status.Play_Status.Time >= Prog_Para.Time)
    {
      debug("prog %d play times %d, end", Prog_Status.Play_Status.Prog_No, Prog_Status.Play_Status.Time);
      return 1;
    }
    else
      return 0;
  }
  else
  {
    ASSERT_FAILED();
    return 1;
  }
}

//检查节目是否播放结束
//返回1表示结束了，0表示还没有结束
INT8U Check_Prog_End(void)
{
#if QT_EN
  if(Preview_Mode EQ PREVIEW_SCREEN)
      return _Check_Prog_End();
  else
      return 1;
#else
  return _Check_Prog_End();
#endif
}

//定时信息中，星期的第0位表示星期1，第6位表示星期六
//检查当前时间是否在节目播放允许时间内，是则返回1，否则返回0
INT8U Check_Prog_Play_Time(void)
{
  //INT8U i;//Re = 1;
  INT8U Temp[20];
  memset(Temp, 0xFF, sizeof(Temp));

