ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
  //按星期定时
  if(Prog_Para.Timing[0].Week_Check > 0)
  {
    if(GET_BIT(Prog_Para.Timing[0].Week_Flag, Cur_Time.Time[T_WEEK]) EQ 0)
      return 0;
  }


  //按日期定时
  if(Prog_Para.Timing[0].Date_Check > 0)
  {
    if(!(Cur_Time.Time[T_YEAR] >= Prog_Para.Timing[0].Start_Date[0] &&\
        Cur_Time.Time[T_YEAR] <= Prog_Para.Timing[0].End_Date[0] &&\
        Cur_Time.Time[T_MONTH] >= Prog_Para.Timing[0].Start_Date[1] &&\
        Cur_Time.Time[T_MONTH] <= Prog_Para.Timing[0].End_Date[1] &&\
        Cur_Time.Time[T_DATE] >= Prog_Para.Timing[0].Start_Date[2] &&\
        Cur_Time.Time[T_DATE] <= Prog_Para.Timing[0].End_Date[2]))
      return 0;

  }

  //按时间定时
  if(Prog_Para.Timing[0].Time_Check > 0)
  {
    if(!(Cur_Time.Time[T_HOUR] >= Prog_Para.Timing[0].Start_Time[0] &&\
        Cur_Time.Time[T_HOUR] <= Prog_Para.Timing[0].End_Time[0] &&\
        Cur_Time.Time[T_MIN] >= Prog_Para.Timing[0].Start_Time[1] &&\
        Cur_Time.Time[T_MIN] <= Prog_Para.Timing[0].End_Time[1]))
      return 0;

  }

  return 1;
}

/*
INT8U Check_Prog_Play_Time()
{
 return 1;
}
*/
//每隔MOVE_STEP_TIMER ms 调用该函数，实现移动效果
void Show_Timer_Proc(void)
{
  //Pub_Timer_Proc(); //定时器
  Update_Show_Data(); //更新显示数据

}

INT8U Inc_Prog_No(INT8U Prog_No)
{
  return 1;
}

void Calc_Prog_Play_Counts(void)
{
    INT16U Min_Counts = 0xFFFF;
    INT8U i;

    //最小播放次数是节目的播放次数---次数也可采用主分区的播放次数
    Min_Counts = 0xFFFF;
    for(i = 0; i < Prog_Para.Area_Num && i < MAX_AREA_NUM; i ++)
    {
      if(Prog_Status.Area_Status[i].Counts < Min_Counts)
        Min_Counts = Prog_Status.Area_Status[i].Counts;
    }

    Prog_Status.Play_Status.Counts = Min_Counts; //在所有分区内的最小播放次数就是节目的总播放次数
    SET_SUM(Prog_Status.Play_Status);
}
//检查是否需要更新节目参数
void Check_Update_Program_Para(void)
{
  INT8U Re;
  INT8U i,Prog_No;//,Count = 0;
  INT16U Len;
  static S_Int8U Sec = {CHK_BYTE, 0xFF, CHK_BYTE};
  static S_Int8U Min = {CHK_BYTE, 0xFF, CHK_BYTE};
  
  //Sec.Var = Cur_Time.Time[T_SEC];
  
  Re = CHK_HT(Prog_Status);
  if(Re EQ 0)
    ASSERT_FAILED();
 
  if(Sec.Var != Cur_Time.Time[T_SEC]) //每秒对实时显示区计时
  {
    TRACE();

    Sec.Var = Cur_Time.Time[T_SEC];
	if(Prog_Status.Play_Status.RT_Play_Time > 0) //当前是否处于实时播放状态，是计时，并到时后退出
	{
	  Prog_Status.Play_Status.RT_Play_Time--;
	  if(Prog_Status.Play_Status.RT_Play_Time EQ 0)
	    RT_Play_Status_Exit();
	}
  }
    //return; 
  if(Prog_Status.Play_Status.New_Prog_Flag EQ 0)//--当前在节目播放状态
  {
    TRACE();

    if(GET_VAR(Min) != Cur_Time.Time[T_MIN]) //每分钟+1，当前节目的播放时间
    {
      Min.Var = Cur_Time.Time[T_MIN];
      Prog_Status.Play_Status.Time ++;
      SET_SUM(Prog_Status.Play_Status);
    }
   
    
    //debug("check prog end! counts = %d", Min_Counts);
    if(Check_Prog_End() > 0)//==0表示节目结束
    {
      //读取该节目的存储索引
      Prog_Status.Play_Status.Play_Flag = 0;
      Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG;
      Prog_Status.Play_Status.Prog_No ++;
      SET_SUM(Prog_Status.Play_Status);

    }
  }

  //if(Prog_Status.Play_Status.Play_Flag EQ 0) //还未进入节目播放状态
  //{
    if(Prog_Status.Play_Status.New_Prog_Flag)//while(1) //寻找下一个可播放的节目
    {
      TRACE();

#if QT_EN
      if(Preview_Mode EQ PREVIEW_PROG)
      {
        Prog_Status.Play_Status.Prog_No = Preview_Prog_No;
        SET_SUM(Prog_Status.Play_Status);
      }
#endif

      if(Prog_Status.Play_Status.Prog_No >= Screen_Para.Prog_Num ||\
         Prog_Status.Play_Status.Prog_No >= MAX_PROG_NUM)
      {
        Prog_Status.Play_Status.Prog_No = 0;
        SET_SUM(Prog_Status.Play_Status);
      }

      debug("\r\n-----update new prog %d para-----\r\n", Prog_Status.Play_Status.Prog_No);

      Re = 1;
      Re &=(Prog_Status.Play_Status.Prog_No EQ Prog_Status.Play_Status.Last_Prog_No)?1:0;
      Re &= CHK_HT(Prog_Status.Play_Status);
      Re &= CHK_SUM(Prog_Status.Play_Status);
      Re &= CHK_SUM(Prog_Para);
      Re &= CHK_SUM(Prog_Status.Block_Index);

      //如果上次播放和当次播放的节目是一样的，则不更新节目参数等
      if(Re)//Prog_Status.Play_Status.Play_Flag = 0;
      {
        TRACE();

        debug("same prog, no update");
        for(i = 0; i < MAX_AREA_NUM; i ++)
        {
          Prog_Status.Area_Status[i].Counts = 0;
          SET_SUM(Prog_Status.Area_Status[i]);
        }
            //memset((INT8U *)Prog_Status.Area_Status[i].CS + CS_BYTES, 0, S_OFF(S_Area_Status, Tail) - S_OFF(S_Area_Status, CS) - CS_BYTES);

        Prog_Status.Play_Status.Time = 0;
        Prog_Status.Play_Status.Counts = 0;
        Prog_Status.Play_Status.New_Prog_Flag = 0;
        SET_SUM(Prog_Status.Play_Status);

        //---------------------
        /*
        Prog_No = Prog_Status.Play_Status.Prog_No;
        Prog_Status_Init();//Clr_Prog_Status();换了个新节目，重新设置状态
        Prog_Status.Play_Status.Prog_No = Prog_No;

        INT8U i;

        memset(&Prog_Status, 0, sizeof(Prog_Status));
        SET_HT(Prog_Status);
        for(i = 0; i < MAX_AREA_NUM; i ++)
        {
          SET_HT(Prog_Status.Area_Status[i]);

          Prog_Status.Area_Status[i].Last_File_No = 0x00;
          Prog_Status.Area_Status[i].Last_SCN_No = 0x00;

          SET_SUM(Prog_Status.Area_Status[i]);
        }

        SET_HT(Prog_Status.Play_Status);
        SET_SUM(Prog_Status.Play_Status);

        SET_SUM(Prog_Status.Play_Status);
*/
        //Clr_Show_Data();

        return;
      }
      
      TRACE();

      Prog_Status.Play_Status.Last_Prog_No = 0xFF; //设置为一个不存在的节目号
      //SET_HT(Prog_Status.Play_Status);
      SET_SUM(Prog_Status.Play_Status);

      Len = Read_Prog_Para(Prog_Status.Play_Status.Prog_No, &Prog_Para); //重新更新节目参数
      
      if(Len > 0 && Check_Prog_Play_Time() > 0)
      {
        TRACE();

        Prog_No = Prog_Status.Play_Status.Prog_No;
        Prog_Status_Init();//Clr_Prog_Status();换了个新节目，重新设置状态
        Prog_Status.Play_Status.Prog_No = Prog_No;
        SET_SUM(Prog_Status.Play_Status);

        Len = Read_Prog_Block_Index(Prog_Status.Play_Status.Prog_No);//重新读取节目的存储索引

        if(Len > 0)
        {
          TRACE();

          Clr_Show_Data();

