ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
//退出实时显示状态
void RT_Play_Status_Exit(void)
{
    Prog_Status.Play_Status.RT_Play_Flag = 0;
	Prog_Status.Play_Status.RT_Play_Time = 0;
    SET_SUM(Prog_Status.Play_Status);
}

void Prog_Status_Init(void)
{
    INT8U i;

  memset(&Prog_Status, 0, sizeof(Prog_Status));
  SET_HT(Prog_Status);
  for(i = 0; i < MAX_AREA_NUM; i ++)
  {
      SET_HT(Prog_Status.Area_Status[i]);

      Prog_Status.Area_Status[i].Last_File_No = 0xFF;
      Prog_Status.Area_Status[i].Last_SCN_No = 0xFFFF;

      SET_SUM(Prog_Status.Area_Status[i]);

      Set_File_Para_HT_Sum(&Prog_Status.File_Para[i]);
      if(Chk_File_Para_HT_Sum(&Prog_Status.File_Para[i]) EQ 0)
          ASSERT_FAILED();
  }

  SET_HT(Prog_Status.Play_Status);
  SET_SUM(Prog_Status.Play_Status);
}

//将内存中的变量初始化头尾
void Ram_Init(void)
{
  //INT8U i;

  memset(&Screen_Para, 0, sizeof(Screen_Para));
  //memset(&Card_Para, 0, sizeof(Card_Para));
  memset(&Prog_Para, 0, sizeof(Prog_Para));
  memset(&Screen_Status, 0, sizeof(Screen_Status));
  memset(&Prog_Status, 0, sizeof(Prog_Status));

#if DATA_PREP_EN >0
  memset(&Prep_Data, 0, sizeof(Prep_Data));
#endif  
  memset(&Show_Data, 0, sizeof(Show_Data));
  memset(&Show_Data_Bak, 0, sizeof(Show_Data_Bak));
  memset(&Cur_Block_Index, 0, sizeof(Cur_Block_Index));
  memset(&Cur_Time, 0, sizeof(Cur_Time));

  SET_HT(Screen_Para);
  SET_HT(Card_Para);
  SET_HT(Prog_Para);
  SET_HT(Screen_Status);
#if DATA_PREP_EN >0
  SET_HT(Prep_Data);
#endif  
  SET_HT(Cur_Block_Index);
  SET_HT(Show_Data);
  SET_HT(Show_Data_Bak);
  SET_HT(Cur_Block_Index);
  SET_HT(Cur_Time);

  Prog_Status_Init();

  Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG;
  Prog_Status.Play_Status.Last_Prog_No = 0xFF;
  SET_HT(Prog_Status.Play_Status);
  SET_SUM(Prog_Status.Play_Status);
}

//显示相关处理
void Show_Main_Proc(void)
{
  Screen_Proc();
  if(Get_Screen_Open_Status() > 0) //当前在开机状态才进入
  {
    Check_Update_Program_Para(); //检查是否需要更新节目
    Check_Update_Show_Data_Bak(); //检查是否需要更新显示备份区数据
#if DATA_PREP_EN >0    
    Check_Update_Data_Prep();
#endif    
    Check_Show_Data_Para();
  }
}

//建立一个实时显示区域,并保存原来的显示参数
void Set_RT_Show_Area(INT16U Width, INT16U Height)
{
//---备份当前参数
  RT_Show_Para.Area_Num = Prog_Para.Area_Num;
  RT_Show_Para.X = Prog_Para.Area[0].X;
  RT_Show_Para.Y = Prog_Para.Area[0].Y;
  RT_Show_Para.X_Len = Prog_Para.Area[0].X_Len;
  RT_Show_Para.Y_Len = Prog_Para.Area[0].Y_Len;	 
  RT_Show_Para.Open_Flag = Screen_Status.Open_Flag;
  //RT_Show_Para.Screen_Width = Screen_Para.Base_Para.Width;
  //RT_Show_Para.Screen_Height = Screen_Para.Base_Para.Height;
  //RT_Show_Para.Screen_Color = Screen_Para.Base_Para.Color;
  SET_HT(RT_Show_Para);

  Prog_Para.Area_Num = 1; //分区数1
  Prog_Para.Area[0].X = 0;
  Prog_Para.Area[0].Y = 0;
  Prog_Para.Area[0].X_Len = Width;//Screen_Para.Base_Para.Width;
  Prog_Para.Area[0].Y_Len = Height;//Screen_Para.Base_Para.Height;
  SET_SUM(Prog_Para);

  //Screen_Para.Base_Para.Width = Width;
  //Screen_Para.Base_Para.Height = Height;
  //Screen_Para.Base_Para.Color = 0x01;
  //SET_SUM(Screen_Para);
 
  Screen_Status.Open_Flag = 1;
}

//恢复显示参数
void Restore_Show_Area(void)
{
  Prog_Para.Area_Num =RT_Show_Para.Area_Num; //分区数1
  Prog_Para.Area[0].X = RT_Show_Para.X;
  Prog_Para.Area[0].Y = RT_Show_Para.Y;
  Prog_Para.Area[0].X_Len = RT_Show_Para.X_Len;//Screen_Para.Base_Para.Width;
  Prog_Para.Area[0].Y_Len = RT_Show_Para.Y_Len;//Screen_Para.Base_Para.Height;
  SET_SUM(Prog_Para);

  //Screen_Para.Base_Para.Width = RT_Show_Para.Screen_Width;
  //Screen_Para.Base_Para.Height = RT_Show_Para.Screen_Height;
  //Screen_Para.Base_Para.Color = RT_Show_Para.Screen_Color;
  //SET_SUM(Screen_Para);
  Screen_Status.Open_Flag = RT_Show_Para.Open_Flag;
}




 //根据format和ap参数表输出调试信息
 // INT16U LED_Print(INT8U Font, INT8U Color, S_Show_Data *pData, INT8U Area_No, INT16U X, INT16U Y, const INT8S *format,...)

//显示初始化
void Para_Init(void)
{
  Ram_Init();
  Read_Screen_Para();
}

void Para_Show(void)
{/*
  INT16U Len;
  //INT8U IP[4];
  //INT32U Baud; //串口波特率

 //显示板卡地址和串口波特率

  Len = RT_LED_Print(FONT0, 0x01, 0, 0, 3, "%d-%d", Screen_Para.COM_Para.Addr, Screen_Para.COM_Para.Baud);

#if UDISK_EN  
  memcpy(IP, &Screen_Para.ETH_Para.IP, 4);	//显示IP地址和端口号
  Len = RT_LED_Print(FONT0, 0x01, Len, 0, 3, "%d.%d.%d.%d:%d", IP[3], IP[2], IP[1], IP[0], Screen_Para.ETH_Para.Port);
#endif
  */
}

void Print_Cur_Time(void)
{
  debug("cur time: %2d-%2d-%2d %2d:%2d:%2d", Cur_Time.Time[T_YEAR], Cur_Time.Time[T_MONTH], Cur_Time.Time[T_DATE],\
                                             Cur_Time.Time[T_HOUR], Cur_Time.Time[T_MIN], Cur_Time.Time[T_SEC]);
}

void Self_Test(INT8U Mode)
{
  INT32U Data = 0x55AA5AA5;
  INT8U Re = 1,i,j,k, m, n, Max_Cols_Fold;
  INT8U Direct,ErrFlag = 0;
  S_Time TempTime,TempTime1;

  if(Screen_Status.Self_Test_Flag) //防止重复进入
    return;

  Screen_Status.Self_Test_Flag = 1;

#if QT_EN EQ 0
  //--------对存储器的测试---------------
  Write_Storage_Data(SDI_TEST_DATA, &Data, sizeof(Data));
  Delay_ms(10);
  memset(&Data, 0x00, sizeof(Data));
  Read_Storage_Data(SDI_TEST_DATA, &Data, &Data, sizeof(Data));

  if(0x55AA5AA5 EQ Data)
  {
    debug("SPI Flash 自检成功");
    Re = Re & 1;
  }
  else
  { 
    debug("SPI Flash 自检失败"); 
	Re = 0;
	ErrFlag	|= 0x01;
  }
  //-----------------------------------------

  //--------对时钟的测试---------------------
  /*
  //while(1)
  {
 // DS1302_Init();

  Re &= _Get_Cur_Time(TempTime.Time);
  Print_Cur_Time();
  Delay_sec(1);//Delay_sec(2);
  Re &=_Get_Cur_Time(TempTime1.Time);

  }
  */
  if(TempTime.Time[T_SEC] != TempTime1.Time[T_SEC])
  {
    debug("时钟自检成功");
    Re = Re & 1;
  }
  else
  {
    debug("时钟自检失败"); 
	Re = 0;
	ErrFlag	|= 0x02;
  }
  //-----------------------------------------

  //---------对485和232的测试---------------
  Screen_Status.Rcv_Posi = 0;
  Com_Send_Byte(CH_COM, 0xA5);
  Delay_ms(5); 
  if(Screen_Status.Rcv_Data[0] EQ 0xA5) //自检成功
  {
    debug("串口自检成功");
    Re = Re & 1;
  }
  else
  {
    debug("串口自检失败"); 
	Re = 0;
	ErrFlag	|= 0x04;
  }
  //---------------------------------------

  if(Re EQ 0)
	debug("外围器件自检失败！");
  else
	debug("外围器件自检成功！");

