ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
  debug("进入屏幕检测状态");
#endif

  //--------------扫描方式检测---------------
  Read_Screen_Para();

  return;
  //-----------
  Screen_Para.Base_Para.Width = 1024;
  Screen_Para.Base_Para.Height = 32;
  Screen_Para.Scan_Para.Cols_Fold = 0;
  Screen_Para.Scan_Para.Rows_Fold = 0;
  Screen_Para.Scan_Para.Rows = 16;
  Screen_Para.Scan_Para.Direct = 0x02;
  Screen_Para.Base_Para.Color = 0x01;
  SET_SUM(Screen_Para);

  Screen_Status.Open_Flag = 1;

  
  //---------------
  Set_RT_Show_Area(64, 64);
  memset(Show_Data.Color_Data, 0x55, sizeof(Show_Data.Color_Data));

  while(1)
  {
    RT_Play_Status_Enter(2);
    //LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", 1, 2, 3, 4);
    //memset(Show_Data.Color_Data, 0x01, sizeof(Show_Data.Color_Data));
   
    for(n = 0; n < 20; n ++)
	{
	  Delay_ms(100);
	  Screen_Com_Proc();

#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
	}
  }

  while(1)
  {
    if(Mode EQ FAC_TEST && Chk_JP_Status() != SELF_TEST_STATUS) //不是自检状态退出
          break;

    for(i = 0; i < 4; i ++)
	{

        Screen_Para.Scan_Para.Direct = i;

      for(j = 0; j <= MAX_ROWS_FOLD; j ++)
	  {
	    Screen_Para.Scan_Para.Rows_Fold = j;

		if(j EQ 0)
		  Max_Cols_Fold = 1;
	    else
		  Max_Cols_Fold = MAX_COLS_FOLD;

		for(k = 1; k <= Max_Cols_Fold; k ++)
	    {
          Screen_Para.Scan_Para.Cols_Fold = k;
		  
		  //5种扫描方式逐步试验
		  for(m = 0; m < 5; m ++)
		  {
		    if(m EQ 0)
			  Screen_Para.Scan_Para.Rows = 16;  //1/16扫描
			else if(m EQ 1)
			  Screen_Para.Scan_Para.Rows = 8;	//1/8扫描
			else if(m EQ 2)
			  Screen_Para.Scan_Para.Rows = 4;	//1/4扫描
			else if(m EQ 3)
			  Screen_Para.Scan_Para.Rows = 2;	//1/2扫描
			else
			  Screen_Para.Scan_Para.Rows = 1;	//静态扫描

			SET_SUM(Screen_Para);

			RT_Play_Status_Enter(2);
            LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", m, i, j, k);
		    //memset(Show_Data.Color_Data, 0x55, sizeof(Show_Data.Color_Data));
           
		    for(n = 0; n < 20; n ++)
			{
			  Delay_ms(100);
			  Screen_Com_Proc();
#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
			}

		  }
	    }
	   }
	 }

	 Restore_Show_Area();

  }
}

 //工厂状态自检
 void Fac_Status_Self_Test(void)
 {
   
  if(Chk_JP_Status() != SELF_TEST_STATUS)
    return;

  Delay_ms(10);

  if(Chk_JP_Status() != SELF_TEST_STATUS)
    return;

  Self_Test(FAC_TEST);

 }
